app/views/patients/show.html.erb


<% if @patient.appointments.any? %>
---
SELECT  1 AS one FROM "appointments" WHERE "appointments"."patient_id" = ? LIMIT 1  [["patient_id", 2]]