app/views/doctors/_form.html.erb

SELECT "specialties".* FROM "specialties"
---
    <%= f.label :specialty %><br>
    <%= f.select :specialty_id, options_from_collection_for_select(Specialty.all, :id, :name, @doctor.specialty_id), include_blank: 'Select specialty' %>