app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("patient_id", "doctor_id", "ailment_id", "appointment_on", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["patient_id", 1], ["doctor_id", 1], ["ailment_id", 1], ["appointment_on", "2016-08-31 06:30:00.000000"], ["created_at", "2016-07-29 18:42:28.545331"], ["updated_at", "2016-07-29 18:42:28.545331"]]

  def update
    respond_to do |format|
      if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "doctor_id" = ?, "ailment_id" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["doctor_id", 8], ["ailment_id", 2], ["updated_at", "2016-07-29 20:02:13.774848"], ["id", 2]]