app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT "doctors".* FROM "doctors"

  def create
    @doctor = Doctor.new(doctor_params)

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("email", "first_name", "last_name", "street", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @doctor.update(doctor_params)
---
UPDATE "doctors" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["first_name", "John"], ["last_name", "Doe"], ["updated_at", "2016-05-23 03:55:02.066284"], ["id", 1]]

  def destroy
    @doctor.destroy
---
DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 1]]

    def set_doctor
      @doctor = Doctor.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]