app/controllers/patients_controller.rb

  def create
    @patient = Patient.new(patient_params)

    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("email", "first_name", "last_name", "street", "city", "state", "zip", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @patient.update(patient_params)
---
UPDATE "patients" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "patients"."id" = ?  [["first_name", "John"], ["last_name", "Doe"], ["updated_at", "2016-05-23 03:55:02.172522"], ["id", 1]]

  def destroy
    @patient.destroy
---
DELETE FROM "patients" WHERE "patients"."id" = ?  [["id", 1]]

    def set_patient
      @patient = Patient.find(params[:id])
---
SELECT  "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 1]]