app/views/appointments/_form.html.erb

    <%= f.label :patient %><br>
    <%= f.select :patient_id, options_from_collection_for_select(Patient.all, :id, :name, @appointment.patient_id), include_blank: 'Select patient' %>
---
SELECT "patients".* FROM "patients"  ORDER BY "patients"."name" ASC

    <%= f.label :ailment %><br>
    <%= f.select :ailment_id, options_from_collection_for_select(Ailment.all, :id, :name, @appointment.ailment_id), include_blank: 'Select ailment' %>
---
SELECT "ailments".* FROM "ailments"

    <%= f.label :doctor %><br>
    <%= f.select :doctor_id, options_from_collection_for_select(Doctor.appropriate_for(@appointment.ailment_id), :id, :name_with_specialty, @appointment.doctor_id), include_blank: 'Select an ailment first' %>
---
SELECT "doctors".* FROM "doctors"